---
kind: type
id: T:Autodesk.Revit.DB.ReferenceArrayIterator
source: html/5b4e4948-c5f0-1e38-d461-7353561774e8.htm
---
# Autodesk.Revit.DB.ReferenceArrayIterator

An iterator to a reference array.

## Syntax (C#)
```csharp
public abstract class ReferenceArrayIterator : APIObject,
	IEnumerator
```